messages/private-certifier/03A_ReceiptAcknowledgement.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/" xmlns:u="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
	<s:Header>
		<ActivityId xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics" CorrelationId="77f81ba7-74c9-463c-8282-d8dd7dfe43d8">c34e6c53-a862-40e6-8c13-0f5d2760ac92</ActivityId>
		<o:Security xmlns:o="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" s:mustUnderstand="1">
			<u:Timestamp u:Id="_0">
				<u:Created>2012-11-26T23:36:44.843Z</u:Created>
				<u:Expires>2012-11-26T23:41:44.843Z</u:Expires>
			</u:Timestamp>
		</o:Security>
	</s:Header>
	<s:Body>
		<ReceiptAcknowledgementSignal xmlns="http://xml.gov.au/edais/bs/ReceiptAcknowledgementSignal.msg.2.3.0r2">
			<ReceiptAcknowledgement>
				<Timestamp xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">2012-11-27T09:36:43.9312543+10:00</Timestamp>
			</ReceiptAcknowledgement>
			<StandardBusinessMessageHeader>
				<BusinessScope xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<CorrelationInformation>
						<ExpectedResponseDateTime>2012-11-27T09:41:43.9471369+10:00</ExpectedResponseDateTime>
						<RequestingDocumentCreationDateTime>2012-11-27T09:36:43.9471897+10:00</RequestingDocumentCreationDateTime>
						<RequestingDocumentInstanceID>04833961-a7d1-43ee-9fd8-b3cf147cbc62</RequestingDocumentInstanceID>
					</CorrelationInformation>
					<Type codeListAgency="NCO" codeListName="BusinessScope">BusinessCollaboration</Type>
				</BusinessScope>
				<DocumentIdentification xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<CreationDateTime>2012-11-27T09:36:43.9318275+10:00</CreationDateTime>
					<InstanceID>04833961-a7d1-43ee-9fd8-b3cf147cbc62</InstanceID>
					<Standard codeListURI="http://xml.gov.au/edais/dt/qdt/msg.type.2.3.0r2" codeListAgency="NCO" codeListName="Standard_Code" codeListVersion="2.3.0r2">eDAIS</Standard>
					<Type>ProposeCreateApplicationTransaction</Type>
					<TypeVersion>2.3.0r2</TypeVersion>
				</DocumentIdentification>
				<ReceiverPartner xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<Authority>Tech One</Authority>
					<ID>0003</ID>
					<ProcessRole>Responder</ProcessRole>
				</ReceiverPartner>
				<SenderPartner xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">
					<Authority>ApplicantSystem</Authority>
					<ID>0002</ID>
					<ProcessRole>Initiator</ProcessRole>
				</SenderPartner>
				<Version xmlns="http://xml.gov.au/edais/core/msg.data.2.3.0r2">2.3.0r2</Version>
			</StandardBusinessMessageHeader>
		</ReceiptAcknowledgementSignal>
	</s:Body>
</s:Envelope>
